{"pageProps":{"posts":[{"title":"Flexbox vi diệu - Sorting bằng CSS như thế nào cho đúng?","slug":"awesome-flexbox","tags":["dev","frontend","css","flexbox"],"excerpt":"Công nghệ phát triển nhanh quá, học thôi còn bắt kịp thời đại.","date":"Jul 12, 2020"},{"title":"Mấy cái trò Database Hacking","slug":"sql-database-hacking","tags":["web","database","hacking","security"],"excerpt":"Hôm nọ mình vừa đọc được một bài write-up của một bạn White-hat sau khi báo cáo lại lỗ hổng trên trang web của Đại học Harvard, tự dưng thấy kỹ năng về bảo mật của mình bao lâu nay... kém ghê","date":"Mar 15, 2020"},{"title":"Toán và Tin - Học toán để làm gì?","slug":"toan-va-tin","tags":["dev","math","algorithm"],"excerpt":"Học toán để làm gì? Câu hỏi khó phết đấy, đố bạn biết học toán dể làm gì, và nó ứng dụng thế nào trong tin học?","date":"Mar 06, 2020"},{"title":"Chuyện mình đi lập trình - Bắt đầu từ đâu?","slug":"chuyen-toi-di-lap-trinh","tags":["dev","talk"],"excerpt":"Ừ thì... Bắt đầu từ con số không chứ từ đâu nữa?","date":"Feb 15, 2020"},{"title":"Tôi đã viết ĐKHP Helper như thế nào?","slug":"toi-da-viet-dkhp-helper-nhu-the-nao","tags":["dev","web","javascript"],"excerpt":"Cứ 9h sáng, kỳ nào cũng thế, không có sự khoan nhượng nào, một trận chiến khốc liệt, đẫm máu, tất cả vỏn vẹn chưa tới một giây...","date":"Aug 07, 2019"},{"title":"Đời - Mùa hè mà tôi ghét?","slug":"my-summer","tags":["life","thinking"],"excerpt":"Mùa hè, nghe tới thôi là đã đầy sức trẻ, tinh thần của những con người sắp được giải tỏa những căng thẳng sau một năm làm việc căng thẳng và mệt mỏi, là lúc mà hằng sa số những đứa học sinh mong chờ để có những ngày nghỉ sau những ngày tháng bào mòn chiếc ghế nhà trường bằng cặp mông vô địch của mình. Ai cũng mong chờ một mùa hè với năng lượng tuổi trẻ rạo rực.","date":"Sep 09, 2018"},{"title":"Ngẫm - Đời về cơ bản là buồn","slug":"doi-ve-co-ban-la-buon","tags":["life","opinion","thinking"],"excerpt":"Trước khi đi vào vấn đề, tôi có một câu hỏi đơn giản dành cho các bạn: \"Bạn là ai?\". Chậm đã, đây không phải là một cuộc phỏng vấn, vì vậy tôi không tìm kiếm những câu trả lời đại loại như: “Tôi là một người nghiêm túc tìm kiếm sự thành đạt. Tôi thích dành thời gian cho công việc, gia đình và bạn bè”. - Cái câu trả lời mà gần như 80% mấy ông đi xin việc đều mở mồm ra là hót một bài như vậy.","date":"Mar 23, 2018"},{"title":"Ngẫm - Sống lâu đâu lên Lão làng?","slug":"song-lau-dau-len-lao-lang","tags":["life","opinion","thinking"],"excerpt":"Ngàn năm văn vở của nước An Nam, lưu truyền hậu thế một triết lý: Kính lão đắc thọ. Ngụ ý là người nhỏ tuổi phải biết kính trọng người lớn tuổi, dần dần nó trở thành nguyên tắc của cuộc sống mà tất cả mọi người đều nghe theo. Điều đó thật tốt","date":"Mar 22, 2018"}]},"__N_SSG":true}